Revit 2017 API
DatumPlane Class
 A base class representing a datum surface (level, grid or reference plane) in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class DatumPlane : Element
Visual Basic
Public Class DatumPlane _
	Inherits Element
Visual C++
public ref class DatumPlane : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DatumPlane
 Autodesk.Revit.DB.Grid
 Autodesk.Revit.DB.Level
 Autodesk.Revit.DB.ReferencePlane
See Also
DatumPlane Members
Autodesk.Revit.DB Namespace